{
  "backend/main.mo": "Motor actor implementing access-controlled user profiles, CTR registration mappings, and admin-managed canister CRUD APIs.",
  "feature_evidence.json": "Feature evidence report listing Scan & Earn feature requirements, affected files, components, and confidence levels.",
  "frontend-file-summaries.txt": "JSON mapping of frontend file paths to short descriptions summarizing their UI, hooks, and utility behavior.",
  "frontend/index.css": "Tailwind base theme defining OKLCH color tokens, dark mode variables, and global element styling.",
  "frontend/index.html": "Basic HTML entry file mounting the React app root and loading main.tsx.",
  "frontend/public/ic-config.json": "IC deployment configuration specifying backend canister ID and host for frontend runtime.",
  "frontend/PUBLISHING.md": "Guide describing prerequisites and steps for building and deploying the Scan & Earn app to the Internet Computer.",
  "frontend/src/App.tsx": "Main React app orchestrating section navigation, CTR connection state syncing, and feature section rendering.",
  "frontend/src/components/scan-earn/AddFundsModal.tsx": "UPI payment modal allowing users to copy UPI ID, launch UPI apps, and submit transaction IDs for adding funds.",
  "frontend/src/components/scan-earn/CoinCounter.tsx": "Displays animated coin balance using count-up animation and balance data from backend queries.",
  "frontend/src/components/scan-earn/CtrConnect.tsx": "Component for validating and connecting a CTR ID with access code, handling errors and updating connection state.",
  "frontend/src/components/scan-earn/Hero.tsx": "Landing hero section displaying headline, coin counter, and scan action button.",
  "frontend/src/components/scan-earn/index.ts": "Re-exports all scan-earn components from a single entry point.",
  "frontend/src/components/scan-earn/PhoneConnect.tsx": "Empty placeholder file.",
  "frontend/src/components/scan-earn/RewardCalculator.tsx": "Displays reward tiers and allows users to select an INR-to-coins tier, showing the chosen reward summary.",
  "frontend/src/components/scan-earn/ScanRewards.tsx": "UI for requesting a WhatsApp NFC code, validating CTR connection before redirecting the user.",
  "frontend/src/components/scan-earn/Wallet.tsx": "Wallet dashboard for managing bank account details, adding funds, and accessing withdrawal tools.",
  "frontend/src/components/scan-earn/WithdrawalPanel.tsx": "Panel for initiating withdrawals with preset amounts, requiring a linked bank account and handling request feedback.",
  "frontend/src/config/icEnv.ts": "Loads and manages Internet Computer environment config, choosing between local defaults and deployed settings.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity, refetching dependent queries when the actor changes.",
  "frontend/src/hooks/useCountUp.ts": "Animates a number smoothly up to a target value using an ease‑out function.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth state, loading, login, and logout via a React context.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for user connection, balances, bank data, and reward tiers with placeholder backend calls.",
  "frontend/src/index.css": "Global Tailwind CSS setup with custom color variables, themes, and utility classes.",
  "frontend/src/lib/format.ts": "Helpers for formatting INR values, coin counts, and validating 7‑digit CTR IDs.",
  "frontend/src/lib/utils.ts": "Utility to merge class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "Bootstraps the app with React Query and Internet Identity providers.",
  "frontend/src/state/flowStore.ts": "Zustand store managing CTR connection state and selected reward tier.",
  "frontend/src/utils/urlParams.ts": "Utilities for reading, storing, persisting, and clearing URL or session parameters.",
  "frontend/src/utils/whatsapp.ts": "Builds WhatsApp deep links and provides a preset link for NFC code requests.",
  "frontend/tailwind.config.js": "Tailwind config enabling dark mode, custom color palette using CSS variables, extended shadows, border radii, and animation keyframes. Includes typography, container queries, and animate plugins.",
  "project_state.json": "Project state metadata describing CTR validation features, WhatsApp scan flow requirements, and existing/new feature requests. Captures architectural notes, versions, and issue tracking details."
}