{
  "backend/main.mo": "Main Motoko canister defining user profiles, transactions, payment requests, messaging, blocking logic, and suspicious activity detection with access control and blob storage mixins.",
  "feature_evidence.json": "Feature evidence metadata listing menu‑related frontend changes, affected files, and associated feature IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries of all frontend files describing their purpose and behavior.",
  "frontend/index.css": "Tailwind base theme defining global OKLCH color variables for light and dark modes.",
  "frontend/index.html": "Root HTML file mounting the React app and loading main.tsx.",
  "frontend/public/ic-config.json": "Empty configuration file placeholder for IC frontend settings.",
  "frontend/PUBLISHING.md": "Guide explaining steps and prerequisites for deploying the app to Internet Computer mainnet.",
  "frontend/src/App.tsx": "Top‑level React component handling session gating and rendering login or main app with React Query provider.",
  "frontend/src/components/auth/EmailPasswordSignInForm.tsx": "Empty auth form placeholder.",
  "frontend/src/components/auth/SignInOptions.tsx": "Empty sign‑in options placeholder.",
  "frontend/src/components/auth/ThirdPartyAuthUnavailableDialog.tsx": "Empty dialog placeholder for unavailable third‑party auth.",
  "frontend/src/components/connection/BackendConfigurationBanner.tsx": "Stub returning null indicating no backend configuration banner.",
  "frontend/src/components/connection/BackendReachabilityBanner.tsx": "Stub returning null for backend reachability banner.",
  "frontend/src/components/connection/ConfigInitializationBanner.tsx": "Stub returning null for config initialization banner.",
  "frontend/src/components/connection/OfflineModeNotice.tsx": "Stub returning null for offline‑mode notice.",
  "frontend/src/components/header/HeaderAuthStatus.tsx": "Stub returning null for header auth status UI.",
  "frontend/src/components/header/HeaderBalanceIndicator.tsx": "Header coin balance display using useGetCoinBalance with formatted output.",
  "frontend/src/components/nav/HamburgerMenu.tsx": "Hamburger slide‑out menu letting users navigate between dashboard, withdrawal, history, admin, and funds transaction history sections.",
  "frontend/src/components/scan-earn/ActorCallErrorNotice.tsx": "Empty placeholder component.",
  "frontend/src/components/scan-earn/AddFundsModal.tsx": "Modal handling UPI payment flow, file upload validation, and submitting add-funds requests with receipt upload progress.",
  "frontend/src/components/scan-earn/CoinCounter.tsx": "Displays animated coin balance using count-up effect and formatted output.",
  "frontend/src/components/scan-earn/ConnectionCanisterSettingsPanel.tsx": "Placeholder component returning null for connection settings.",
  "frontend/src/components/scan-earn/CtrConnect.tsx": "Placeholder component returning null for CTR connection.",
  "frontend/src/components/scan-earn/FaceVerification.tsx": "Placeholder component returning null for face verification.",
  "frontend/src/components/scan-earn/Hero.tsx": "Empty file with no implementation.",
  "frontend/src/components/scan-earn/index.ts": "Exports scan-earn components for module aggregation.",
  "frontend/src/components/scan-earn/PaymentPage.tsx": "Empty file with no implementation.",
  "frontend/src/components/scan-earn/PhoneConnect.tsx": "Empty file with no implementation.",
  "frontend/src/components/scan-earn/RewardCalculator.tsx": "Displays reward tiers, ROI, and allows selecting a funds package.",
  "frontend/src/components/scan-earn/ScanRewards.tsx": "Empty file with no implementation.",
  "frontend/src/components/scan-earn/SessionUserIdOverlay.tsx": "Empty file with no implementation.",
  "frontend/src/components/scan-earn/Wallet.tsx": "Shows wallet overview, balance, add-funds button, and withdrawal panel.",
  "frontend/src/components/scan-earn/WithdrawalPanel.tsx": "Handles coin withdrawal with quick amounts, validation, and submitting transactions.",
  "frontend/src/components/sections/ActiveSectionView.tsx": "Renders the active UI section based on global flow state.",
  "frontend/src/components/sections/AdminPanelSection.tsx": "Admin dashboard supporting authentication, user management, payment approvals, blocking, and message replies.",
  "frontend/src/components/sections/CustomerSupportSection.tsx": "Implements a customer support chat UI that loads messages from the backend and allows authenticated users to send new ones.",
  "frontend/src/components/sections/FundsHistorySection.tsx": "Displays a page wrapper for viewing the user's add‑funds transaction history via AddFundsHistoryList.",
  "frontend/src/components/sections/LandingSection.tsx": "Renders the homepage with hero text, a live trading graphic, CTAs, and feature cards, updating app flow state on button actions.",
  "frontend/src/components/sections/LoginConnectionSection.tsx": "Empty file with no implementation.",
  "frontend/src/components/sections/StocksFundsSection.tsx": "Shows the reward calculator and conditionally displays a modal for adding funds based on the selected tier.",
  "frontend/src/components/sections/WinningHistorySection.tsx": "Presents a card indicating that no winning history exists yet for the user.",
  "frontend/src/components/sections/WithdrawalHistorySection.tsx": "Wraps and displays the user’s withdrawal history using WithdrawalHistoryList.",
  "frontend/src/components/sections/WithdrawalSection.tsx": "Provides a withdrawal UI section that displays the WithdrawalPanel.",
  "frontend/src/components/securepanel/RequirePlkSession.tsx": "Guards children components by checking session validity and rendering a fallback when unauthenticated.",
  "frontend/src/components/securepanel/SecurePanelTopBar.tsx": "Shows the user's session ID and provides a logout button that clears session data and resets app state.",
  "frontend/src/components/support/ruleBasedAssistant.ts": "Empty file with no implementation.",
  "frontend/src/components/trading/HighLowTradingGraphic.tsx": "Displays a live‑updating simulated trading chart with high/low indicators and current movement stats.",
  "frontend/src/components/transactions/AddFundsHistoryList.tsx": "Fetches and displays add‑funds transactions in a table with loading, error, and empty states.",
  "frontend/src/components/transactions/WithdrawalHistoryList.tsx": "Fetches and shows withdrawal transactions with appropriate loading, error, and empty handling.",
  "frontend/src/config/icEnv.ts": "Defines and caches static Internet Computer environment configuration with helper accessors.",
  "frontend/src/config/rewardTiers.ts": "Defines a RewardTier interface and a constant list mapping INR amounts to coin rewards.",
  "frontend/src/config/upi.ts": "Provides UPI configuration and a helper to build UPI payment URLs.",
  "frontend/src/hooks/useActor.ts": "Initializes an authenticated or anonymous backend actor and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useActorResilient.ts": "Creates a resilient anonymous actor with retry logic and exposes its loading and error states.",
  "frontend/src/hooks/useBackendReachability.ts": "Checks backend reachability by calling a lightweight actor method with timeout handling.",
  "frontend/src/hooks/useBlinkDetection.ts": "Detects blinks from a video element using brightness-based eye openness estimation and tracks blink count.",
  "frontend/src/hooks/useCountUp.ts": "Animates a number smoothly toward a target value using an ease‑out curve.",
  "frontend/src/hooks/useInitializationTimeout.ts": "Tracks whether an initialization process has exceeded a timeout and provides a reset function.",
  "frontend/src/hooks/useInternetIdentity.ts": "Manages Internet Identity authentication state, loading, login, and logout using AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Wraps backend queries and mutations for user profiles, balances, funds, withdrawals, and messages with react‑query.",
  "frontend/src/hooks/useSimulatedTradingSeries.ts": "Generates a bounded random‑walk time series that updates at a fixed interval for simulated trading data.",
  "frontend/src/hooks/useSpoofHeuristics.ts": "React hook that analyzes video frame variance over time to flag low‑motion spoofing and manage detection state.",
  "frontend/src/index.css": "Tailwind base styles with custom OKLCH theme variables, dark mode tokens, and utility classes like glass and elevation.",
  "frontend/src/lib/connectionDiagnostics.ts": "Empty placeholder file for connection diagnostics utilities.",
  "frontend/src/lib/format.ts": "Formatting helpers for INR amounts, coin numbers, and digit‑only string extraction.",
  "frontend/src/lib/icErrorParser.ts": "Parses IC/agent errors into a structured model with flags for common failure types and extracted metadata.",
  "frontend/src/lib/plkAllowlist.ts": "Contains a fixed allowlist of 20 PLK codes and a function to validate a provided code.",
  "frontend/src/lib/plkSession.ts": "Manages an 8‑digit numeric session ID with generation, storage, validation, and clearing helpers.",
  "frontend/src/lib/sessionUserId.ts": "Generates a cryptographically random user ID in the format USER‑XXXXXXXX.",
  "frontend/src/lib/supportedLogin.ts": "Empty placeholder file for supported login logic.",
  "frontend/src/lib/supportEmail.ts": "Builds Gmail and mailto URLs and opens a prefilled support email with fallback handling.",
  "frontend/src/lib/useHashRoute.ts": "Empty placeholder file for hash‑based routing logic.",
  "frontend/src/lib/utils.ts": "Exports a cn() helper merging clsx and tailwind‑merge for className composition.",
  "frontend/src/main.tsx": "App entry point mounting React, React Query, Internet Identity provider, and global styles.",
  "frontend/src/pages/SecureAccessGateway.tsx": "Login page that validates a 6‑digit PLK code, manages session creation, and handles email request fallback.",
  "frontend/src/pages/SecurePanelDashboard.tsx": "Empty placeholder file for a secure panel dashboard page.",
  "frontend/src/pages/StocksHomePage.tsx": "Home page layout with header, navigation, balance indicator, main section view, and footer branding.",
  "frontend/src/state/flowStore.ts": "Zustand store managing selected tier and active section with sessionStorage persistence and a reset function.",
  "frontend/src/utils/urlParams.ts": "Utility functions to read, store, persist, and clear URL and session parameters, including hash-based routing support.",
  "frontend/src/utils/whatsapp.ts": "Empty placeholder file for WhatsApp-related utilities.",
  "frontend/tailwind.config.js": "Tailwind configuration extending colors, shadows, keyframes, and container settings with plugins enabled.",
  "project_state.json": "Project state describing menu consolidation requirements, navigation wiring, and naming consistency for Funds Transaction History."
}