{
  "backend/main.mo": "Motoko canister managing users, phone connection, coin balances, bank accounts, and transaction-based fund additions with validation and queries.",
  "feature_evidence.json": "Feature evidence report mapping product requirements to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of each frontend file in the project.",
  "frontend/index.css": "Tailwind base styles defining OKLCH color tokens and dark-mode variables for the UI theme.",
  "frontend/index.html": "Base HTML page that mounts the React app and loads main.tsx.",
  "frontend/src/App.tsx": "Main React component orchestrating the Scan & Earn flow with section scrolling and conditional rendering after phone connection.",
  "frontend/src/components/scan-earn/AddFundsModal.tsx": "Modal for adding funds via GPay/BHIM, showing QR code, payment number, and transaction ID submission.",
  "frontend/src/components/scan-earn/CoinCounter.tsx": "Animated coin balance display using live backend balance and count‑up animation.",
  "frontend/src/components/scan-earn/Hero.tsx": "Displays a hero section with a background image, headline, coin counter, and a CTA button that triggers scanning.",
  "frontend/src/components/scan-earn/index.ts": "Re-exports Scan & Earn components for easy importing.",
  "frontend/src/components/scan-earn/PhoneConnect.tsx": "Handles phone number validation and connection workflow, showing either a form or a success state.",
  "frontend/src/components/scan-earn/RewardCalculator.tsx": "Shows reward tiers and lets users select one to see corresponding INR-to-coins rewards.",
  "frontend/src/components/scan-earn/ScanRewards.tsx": "Simulates a QR scan process with visual states for idle, scanning, and success.",
  "frontend/src/components/scan-earn/Wallet.tsx": "Manages displaying or adding a user's bank account and provides access to an add-funds modal.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to Internet Identity, invalidating dependent queries when identity changes.",
  "frontend/src/hooks/useCountUp.ts": "Provides an animated count-up hook that eases values toward a target number.",
  "frontend/src/hooks/useInternetIdentity.ts": "Implements Internet Identity authentication context, handling login, logout, and loading stored identities.",
  "frontend/src/hooks/useQueries.ts": "React Query hooks for user connection, balances, reward tiers, bank accounts, and fund additions, with mutations that invalidate relevant queries.",
  "frontend/src/index.css": "Tailwind base styles plus custom CSS variables and utilities for dark-mode glassmorphism, color tokens, and glow effects.",
  "frontend/src/lib/format.ts": "Utility functions for formatting INR values, coin numbers, and normalizing or validating Indian phone numbers.",
  "frontend/src/lib/utils.ts": "Provides a `cn` helper that merges class names using clsx and tailwind-merge.",
  "frontend/src/main.tsx": "App entry point that sets up ReactDOM, React Query client, Internet Identity provider, and global styles.",
  "frontend/src/state/flowStore.ts": "Zustand store managing flow state like phone connection, selected reward tier, and flow resets.",
  "frontend/tailwind.config.js": "Tailwind configuration enabling dark mode, custom colors via CSS variables, extended theme settings, and plugins.",
  "project_state.json": "Project metadata describing the fintech app’s goals, features, architecture notes, and image requirements."
}