{
  "kind": "build_request",
  "title": "Remove all authentication flows and eliminate canister/connection system so the app opens directly",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Remove all user-facing authentication and verification flows so users can access the app immediately without any login steps, including: CTR ID, access code, email/password, face authentication, and any Internet Identity sign-in UI.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remove all authentications include CTR AND ACCESS CODE AND EMAIL PASSWORD AND FACE AUTHENTICATION USER CAN ACCESS APP DIRECTLY"
        ]
      },
      "acceptanceCriteria": [
        "No screen, modal, banner, or section prompts the user to enter a CTR ID or access code.",
        "No screen, modal, banner, or section prompts the user to enter email/password.",
        "No face verification UI is shown or required anywhere in the app.",
        "There is no Internet Identity sign-in button or login prompt shown anywhere in the app.",
        "User can open the app in a fresh browser session and immediately see the main app content without interacting with any authentication UI."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Remove any feature gating or conditional navigation that depends on authentication, identity state, CTR connection, access code validation, or connection state, and ensure all primary sections (Stocks & Funds, Withdrawal, Customer Support) are accessible immediately on app load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "USER CAN ACCESS APP DIRECTLY"
        ]
      },
      "acceptanceCriteria": [
        "On initial load, the app shows a primary section (not a login/connection/auth screen).",
        "Navigation menu contains only main sections (Stocks & Funds, Withdrawal, Customer Support) and none related to login/connection/auth/verification.",
        "All main sections render and are usable without requiring any identity/CTR/access-code step."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Remove CTR/access-code related validation utilities and any UI logic that depends on them so the app no longer enforces CTR ID allowlists or shared access-code allowlists.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remove all authentications include CTR AND ACCESS CODE"
        ]
      },
      "acceptanceCriteria": [
        "No code path in the UI blocks access based on `validateCtrId` or `validateAccessCode` checks.",
        "No user-facing error messages referencing CTR ID or access code validation appear during normal app usage."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Eliminate the canister/connection configuration system from the end-user experience by removing any connection/config initialization banners, backend reachability banners, offline mode notices, and any connection settings panels from the rendered UI so the app does not present canister configuration as a user task.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "REMOVE CANSISTER SYSTEM PERMANENTLY"
        ]
      },
      "acceptanceCriteria": [
        "No connection/config/offline/reachability banners or notices are displayed anywhere in the app UI.",
        "There is no visible UI that asks the user to configure or validate a canister ID."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Remove backend-side authorization requirements so all backend methods used by the app work for anonymous callers, and preserve compatibility with the existing frontend actor creation by keeping any previously-exposed initialization method as a no-op if it is still referenced by generated interfaces.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "Remove all authentications",
          "REMOVE CANSISTER SYSTEM PERMANENTLY"
        ]
      },
      "acceptanceCriteria": [
        "Backend calls used by the UI (profile, balance, add funds, withdraw, histories, health check) succeed for anonymous principals and do not trap due to authorization/permission checks.",
        "If the frontend still references an access-control initialization method (e.g., `_initializeAccessControlWithSecret`), the backend continues to expose it and it performs no authorization gating (no-op) so the app remains buildable and runnable.",
        "No backend feature requires CTR/access code/email/password/face verification to call core methods."
      ]
    }
  ],
  "constraints": [
    "Do not modify files under frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or anything under frontend/src/components/ui (immutable paths).",
    "Keep backend as a single Motoko actor in backend/main.mo; only add a migration if a stable-state upgrade is required."
  ],
  "nonGoals": [
    "Adding any new authentication mechanism (including third-party auth).",
    "Adding new product features unrelated to removing authentication and canister/connection UX.",
    "Introducing external databases or off-chain services."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}