{
  "kind": "build_request",
  "title": "Enforce 7-digit CTR + access code, and redirect Scan to WhatsApp with prefilled NFC request",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the CTR connect flow UI to require (a) a CTR value that is exactly 7 digits and (b) an access code that must equal \"IQL0918\" (case-insensitive acceptance is OK, but store/display it uppercased). The user must not be able to proceed/\"Connect\" unless both validations pass, and error messages must be shown in English.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "CTR MUST ME 7 DIGITS USER NEED TO ENTER ONLY IQL0918."
        ]
      },
      "acceptanceCriteria": [
        "CTR Connect screen copy no longer references a 13-character CTR format or an \"IN\" suffix.",
        "CTR input only accepts digits and is limited to 7 characters.",
        "Access code input is present and required; it validates against exactly \"IQL0918\".",
        "The Connect button is disabled until CTR is 7 digits and access code matches.",
        "Invalid inputs show clear English error messages (and existing toast behavior remains consistent)."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Change CTR validation logic to match the new requirement: CTR must be exactly 7 digits. Remove the previous 13-character + \"IN\" format validation from the validation helper(s) used by the CTR connect flow.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "CTR MUST ME 7 DIGITS"
        ]
      },
      "acceptanceCriteria": [
        "Calling the CTR validation with anything other than 7 digits returns invalid with an English error message.",
        "\"1234567\" is treated as valid CTR.",
        "Any alphabetic characters, spaces, or length != 7 are treated as invalid CTR."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Implement backend support for CTR registration so that the system can enforce \"Only per CTR Registered user\": add backend methods to (1) connect/register a CTR for the calling principal and (2) query whether the caller is already connected/registered. Enforce that a principal can only register one CTR, and that the same CTR cannot be registered by multiple principals.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Only per CTR Registered user"
        ]
      },
      "acceptanceCriteria": [
        "Backend exposes a method to register/connect CTR for the caller and persists the association.",
        "Backend exposes a method to query whether the caller is connected/registered (boolean).",
        "Attempting to register a second CTR for the same principal fails with a clear error.",
        "Attempting to register a CTR that is already registered to another principal fails with a clear error.",
        "State is preserved across canister upgrades (add a migration if required by the chosen state representation)."
      ]
    },
    {
      "id": "REQ-4",
      "text": "Wire the existing React Query hooks for CTR connection to the backend implementation so the CTR connect UI can actually connect and the app can correctly detect connected state after refresh/reload.",
      "target": "both",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Only per CTR Registered user"
        ]
      },
      "acceptanceCriteria": [
        "The \"Connect\" action no longer throws \"Backend method connectCtrId not implemented yet\".",
        "After a successful connect, the app treats the user as connected (the scan section gating works as designed).",
        "On page reload, connected users are still recognized as connected via the backend query hook."
      ]
    },
    {
      "id": "REQ-5",
      "text": "Replace the current simulated scan behavior with a \"Scan\" action that redirects the user to WhatsApp for Indian number +91 9541525891 with a prefilled message that includes exactly: (1) \"Get NFC code of 4 digits\" and (2) \"Code works only: CTTH\" and (3) \"Only per CTR Registered user\". Use an https://wa.me/ link (or equivalent WhatsApp deep link) and URL-encode the message.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "IF user click on scan option redirect to whatsapp indian number 9541525891 add Get NFC code of 4 digits on message to send me Code works only: CTTH Only per CTR Registered user"
        ]
      },
      "acceptanceCriteria": [
        "Clicking the scan action opens/redirects to WhatsApp chat for +91 9541525891.",
        "The prefilled WhatsApp message contains the exact required English phrases: \"Get NFC code of 4 digits\", \"Code works only: CTTH\", and \"Only per CTR Registered user\".",
        "The message text is correctly URL-encoded (no broken link; spaces/newlines handled).",
        "The prior simulated scanning timer/success animation is removed or no longer triggers on scan click."
      ]
    },
    {
      "id": "REQ-6",
      "text": "Ensure scan/redirect is only available to CTR-registered users: if a user is not connected/registered, prevent the WhatsApp redirect and show an English error prompt instructing them to connect/register their CTR first.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-4"
        ],
        "quotes": [
          "Only per CTR Registered user"
        ]
      },
      "acceptanceCriteria": [
        "When not connected, clicking the scan action does not open WhatsApp.",
        "When not connected, the app shows an English toast/message like \"Please connect your CTR first\" (or similar).",
        "When connected, the scan action successfully redirects to WhatsApp."
      ]
    }
  ],
  "constraints": [
    "Backend must remain single-actor (all Motoko logic in backend/main.mo).",
    "Do not edit files under frontend/src/components/ui or any frontend immutablePaths listed in SYSTEM_CONTEXT; compose them instead.",
    "Use English for any user-facing text."
  ],
  "nonGoals": [
    "Implementing WhatsApp Business API integration, message delivery tracking, or inbound code verification via WhatsApp.",
    "Adding real camera/QR scanning functionality (the scan action is a redirect).",
    "Adding third-party authentication methods (only Internet Identity is allowed)."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}