{
  "kind": "build_request",
  "title": "Show a single upper-sidebar menu on the main home page with dashboard navigation items",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Update the main home page upper sidebar menu (the hamburger menu shown in the header on StocksHomePage) so it displays a single consolidated menu containing only these items: Dashboard, Withdrawal, Withdrawal History, Admin Panel, and Funds Transaction History.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "1: main home page upper side bar.\n2 dashboard\n3 withdrawal option and withdrawal history and admin panel option and funds transaction history."
        ]
      },
      "acceptanceCriteria": [
        "On the main home page header, the hamburger menu opens a single menu panel.",
        "The menu panel shows exactly 5 navigation items: \"Dashboard\", \"Withdrawal\", \"Withdrawal History\", \"Admin Panel\", and \"Funds Transaction History\".",
        "The menu panel does not show any other items currently present (e.g., \"Stocks & Funds\", \"Winning History\", \"Customer Care\", \"Customer Support\")."
      ]
    },
    {
      "id": "REQ-2",
      "text": "Wire the consolidated menu items to the existing section navigation state so each item switches the visible content area accordingly: Dashboard -> home section, Withdrawal -> withdrawal section, Withdrawal History -> withdrawalHistory section, Admin Panel -> adminPanel section, Funds Transaction History -> fundsHistory section.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "2 dashboard\n3 withdrawal option and withdrawal history and admin panel option and funds transaction history."
        ]
      },
      "acceptanceCriteria": [
        "Clicking \"Dashboard\" sets the active section to the existing home/landing section and closes the menu.",
        "Clicking \"Withdrawal\" sets the active section to \"withdrawal\" and closes the menu.",
        "Clicking \"Withdrawal History\" sets the active section to \"withdrawalHistory\" and closes the menu.",
        "Clicking \"Admin Panel\" sets the active section to \"adminPanel\" and closes the menu.",
        "Clicking \"Funds Transaction History\" sets the active section to \"fundsHistory\" and closes the menu."
      ]
    },
    {
      "id": "REQ-3",
      "text": "Update user-facing section labels/headings related to funds history so they consistently use the phrase \"Funds Transaction History\" anywhere this destination is shown from the menu and on the funds history section page header.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "funds transaction history."
        ]
      },
      "acceptanceCriteria": [
        "In the consolidated menu, the item label reads \"Funds Transaction History\" (not \"Funds History\").",
        "In the funds history section header, the main title uses \"Funds Transaction History\" in English.",
        "No other section titles are unintentionally changed."
      ]
    }
  ],
  "constraints": [
    "Do not edit files under frontend/src/components/ui (read-only).",
    "Do not edit frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useInternetIdentity.tsx, frontend/src/hooks/useActor.ts, or frontend/src/main.tsx (immutable paths).",
    "Keep navigation implemented via the existing flowStore activeSection mechanism (no new routing framework).",
    "Backend changes are not required for this request."
  ],
  "nonGoals": [
    "Adding new backend transaction types or new canister APIs.",
    "Implementing real-time updates or notifications for transaction history.",
    "Creating a new standalone Dashboard page route; \"Dashboard\" should map to the existing home section unless explicitly requested otherwise."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  },
  "userProfileUpdate": {
    "goalsToAdd": [],
    "goalsToRemove": [],
    "preferencesToAdd": [],
    "preferencesToRemove": [],
    "miscToAdd": [],
    "miscToRemove": [],
    "fieldsToSet": {},
    "fieldsToDelete": []
  }
}