{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "CTR connect validation + WhatsApp scan redirect gated by CTR registration",
  "requirements": [
    {
      "id": "REQ-1",
      "summary": "Update CTR connect UI to require a 7-digit numeric CTR and an access code matching IQL0918 (case-insensitive; stored/displayed uppercase), blocking Connect until valid and showing English errors.",
      "acceptanceCriteria": [
        "CTR Connect screen copy no longer references a 13-character CTR format or an \"IN\" suffix.",
        "CTR input only accepts digits and is limited to 7 characters.",
        "Access code input is present and required; it validates against exactly \"IQL0918\".",
        "The Connect button is disabled until CTR is 7 digits and access code matches.",
        "Invalid inputs show clear English error messages (and existing toast behavior remains consistent)."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/scan-earn/CtrConnect.tsx",
          "operation": "modify",
          "description": "Update the CTR connect form to: (1) change all copy to reference a 7-digit CTR (remove 13-char/\"IN\" references), (2) restrict CTR input to digits-only and maxLength=7, (3) add an Access Code input that uppercases on change and validates against \"IQL0918\" (case-insensitive acceptance, but store/display uppercase), (4) disable the Connect button until both CTR and access code validations pass, and (5) show clear English inline errors while preserving existing toast behavior. Use existing shadcn-ui form primitives already imported (Input/Label/Button/Card) to compose the UI (do not edit ui components). Verify the component's usage instructions before implementing."
        }
      ]
    },
    {
      "id": "REQ-2",
      "summary": "Replace existing CTR validation helper logic to enforce exactly 7 digits with English error messages.",
      "acceptanceCriteria": [
        "Calling the CTR validation with anything other than 7 digits returns invalid with an English error message.",
        "\"1234567\" is treated as valid CTR.",
        "Any alphabetic characters, spaces, or length != 7 are treated as invalid CTR."
      ],
      "file_operations": [
        {
          "path": "frontend/src/lib/format.ts",
          "operation": "modify",
          "description": "Rewrite validateCtrId() to validate CTR as exactly 7 digits (no spaces, no letters, length must equal 7). Remove the old 13-character + \"IN\" suffix logic and ensure returned error messages are clear and in English."
        }
      ]
    },
    {
      "id": "REQ-4",
      "summary": "Wire existing React Query hooks and app flow gating to the backend CTR registration/check methods so connected state persists across reload.",
      "acceptanceCriteria": [
        "The \"Connect\" action no longer throws \"Backend method connectCtrId not implemented yet\".",
        "After a successful connect, the app treats the user as connected (the scan section gating works as designed).",
        "On page reload, connected users are still recognized as connected via the backend query hook."
      ],
      "file_operations": [
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Update CTR-related React Query hooks to call the available backend capabilities via the actor: (1) useIsUserConnected should call actor.isCTRRegistered() instead of returning false; (2) useConnectCtrId should call actor.registerCTR(...) instead of throwing \"not implemented yet\"; keep query invalidations consistent so connected state and dependent UI refresh correctly."
        },
        {
          "path": "frontend/src/App.tsx",
          "operation": "modify",
          "description": "Ensure the app’s gating based on Zustand flowStore stays in sync with the backend-derived connected state after refresh/reload (e.g., read useIsUserConnected() and setCtrConnected accordingly). This prevents the scan/rewards section from disappearing on reload for already-registered users."
        },
        {
          "path": "frontend/src/backend.d.ts",
          "operation": "modify",
          "description": "Align the frontend actor TypeScript typing for CTR registration/check with the implemented backend method signatures used by the updated hooks (so the React Query hooks compile cleanly after wiring)."
        }
      ]
    },
    {
      "id": "REQ-5",
      "summary": "Replace simulated scan behavior with a Scan action that redirects to WhatsApp (+91 9541525891) using a wa.me link and a URL-encoded prefilled message containing the exact required phrases.",
      "acceptanceCriteria": [
        "Clicking the scan action opens/redirects to WhatsApp chat for +91 9541525891.",
        "The prefilled WhatsApp message contains the exact required English phrases: \"Get NFC code of 4 digits\", \"Code works only: CTTH\", and \"Only per CTR Registered user\".",
        "The message text is correctly URL-encoded (no broken link; spaces/newlines handled).",
        "The prior simulated scanning timer/success animation is removed or no longer triggers on scan click."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/scan-earn/ScanRewards.tsx",
          "operation": "modify",
          "description": "Remove the simulated scan timer/success animation behavior and replace it with a single Scan action that redirects to WhatsApp for +91 9541525891 using an https://wa.me/ deep link with a URL-encoded message containing exactly: \"Get NFC code of 4 digits\", \"Code works only: CTTH\", and \"Only per CTR Registered user\". Keep the UI composed using existing shadcn-ui Card/Button components (do not edit ui components). Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/utils/whatsapp.ts",
          "operation": "create",
          "description": "Add a small helper to build the WhatsApp deep link (wa.me) for +91 9541525891 and URL-encode the required prefilled message (handling spaces/newlines safely)."
        }
      ]
    },
    {
      "id": "REQ-6",
      "summary": "Gate the WhatsApp scan redirect to CTR-registered users and show an English error toast/prompt when not connected.",
      "acceptanceCriteria": [
        "When not connected, clicking the scan action does not open WhatsApp.",
        "When not connected, the app shows an English toast/message like \"Please connect your CTR first\" (or similar).",
        "When connected, the scan action successfully redirects to WhatsApp."
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/scan-earn/ScanRewards.tsx",
          "operation": "modify",
          "description": "Before redirecting to WhatsApp, check connected/registered state via the existing connected-state hook and/or synced flow state. If not connected, prevent navigation and show an English error toast (using existing toast/sonner behavior). If connected, proceed with the WhatsApp redirect. Verify the component's usage instructions before implementing."
        },
        {
          "path": "frontend/src/components/scan-earn/CtrConnect.tsx",
          "operation": "modify",
          "description": "Ensure successful CTR connection updates the app’s connected state consistently (Zustand store + query invalidation) so ScanRewards gating works immediately after connect. Use existing toast behavior for success/error messaging. Verify the component's usage instructions before implementing."
        }
      ]
    }
  ]
}