{
  "schemaVersion": "1.0.0",
  "projectStateVersion": 3,
  "summary": "App should open directly with no authentication; remove the canister system permanently.",
  "architectural_notes": [
    "App must allow direct access with no authentication (no CTR, access code, email/password, or face authentication).",
    "Canister system is to be removed permanently; ensure dependent flows are deleted/disabled."
  ],
  "known_issues": [],
  "isFixRequest": false,
  "existing_features": [
    {
      "id": "feature-remove-all-user-facing-authentication-and-verification-flows-so-users-can-access-the-app-immediately-without-any-login-steps-including-ctr-id-access-code-email-password-face-authentication-and-any-internet-identity-sign-in-ui",
      "title": "Remove all user-facing authentication and verification flows so users can access the app immediately without any login steps, including: CTR ID, access code, email/password, face authentication, and any Internet Identity sign-in UI.",
      "reqIds": [
        "REQ-1"
      ],
      "version": 1
    },
    {
      "id": "feature-remove-ctr-access-code-related-validation-utilities-and-any-ui-logic-that-depends-on-them-so-the-app-no-longer-enforces-ctr-id-allowlists-or-shared-access-code-allowlists",
      "title": "Remove CTR/access-code related validation utilities and any UI logic that depends on them so the app no longer enforces CTR ID allowlists or shared access-code allowlists.",
      "reqIds": [
        "REQ-3"
      ],
      "version": 1
    },
    {
      "id": "feature-eliminate-the-canister-connection-configuration-system-from-the-end-user-experience-by-removing-any-connection-config-initialization-banners-backend-reachability-banners-offline-mode-notices-and-any-connection-settings-panels-from-the-rendered-ui-so-the-app-does-not-present-canister-configuration-as-a-user-task",
      "title": "Eliminate the canister/connection configuration system from the end-user experience by removing any connection/config initialization banners, backend reachability banners, offline mode notices, and any connection settings panels from the rendered UI so the app does not present canister configuration as a user task.",
      "reqIds": [
        "REQ-4"
      ],
      "version": 1
    }
  ],
  "new_feature_requests": [
    {
      "id": "AR-1",
      "summary": "Remove all authentication methods (CTR, access code, email/password, face authentication) so users can access the app directly.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-2",
      "summary": "Remove the canister system permanently from the app.",
      "reqIds": [],
      "status": "pending"
    },
    {
      "id": "AR-4",
      "summary": "Remove any feature gating or conditional navigation that depends on authentication, identity state, CTR connection, access code validation, or connection state, and ensure all primary sections (Stocks & Funds, Withdrawal, Customer Support) are accessible immediately on app load.",
      "reqIds": [
        "REQ-2"
      ],
      "status": "pending"
    },
    {
      "id": "AR-7",
      "summary": "Remove backend-side authorization requirements so all backend methods used by the app work for anonymous callers, and preserve compatibility with the existing frontend actor creation by keeping any previously-exposed initialization method as a no-op if it is still referenced by generated interfaces.",
      "reqIds": [
        "REQ-5"
      ],
      "status": "pending"
    }
  ],
  "projectName": "Remove all authentication flows and eliminate canister/connection system so the app opens directly",
  "clarification_mode": "instant",
  "clarification_rounds": 0
}