{
  "kind": "spec_vs_diff_report",
  "version": "1.0",
  "generatedAt": "2026-02-09T07:57:17.703Z",
  "summary": "Diff implements WhatsApp redirect with URL-encoded prefilled message and adds frontend/backend wiring for a CTR-registered gating check. However, several core requirements are only partially met: backend registration does not persist across upgrades and uses Principals rather than the required 7-digit CTR value; the frontend connect mutation ignores the entered CTR; and the CTR connect UI validation/UX requirements cannot be fully verified from the truncated diff (and appears to miss uppercasing storage/display of the access code and possibly input restrictions/disabled Connect behavior).",
  "missing_requirements": [
    {
      "id": "REQ-1",
      "requirement": "CTR connect flow UI must require a CTR that is exactly 7 digits and an access code equal to \"IQL0918\" (case-insensitive OK but store/display uppercased); user cannot proceed unless both pass; CTR input only digits limited to 7; Connect disabled until valid; clear English errors; remove old 13-char/IN copy.",
      "reason": "Only partial evidence is present. While the component adds an access code field and references a 7-digit CTR in description, the diff is truncated before showing CTR Input constraints (digits-only and maxLength=7) and whether the Connect button is disabled until validations pass. Also, the access code is validated case-insensitively but the value is not stored/displayed uppercased (state is kept as entered).",
      "evidence": [
        "frontend/src/components/scan-earn/CtrConnect.tsx (truncated)"
      ]
    },
    {
      "id": "REQ-3",
      "requirement": "Backend support for CTR registration: register/connect CTR for caller and query registered status; enforce one CTR per principal and uniqueness across principals; preserve state across canister upgrades (migration if needed).",
      "reason": "Backend adds registration and query methods and enforces uniqueness, but stores maps in non-stable variables and provides no preupgrade/postupgrade (or stable data structure) to preserve state across upgrades. Also, it registers a CTR as a Principal, not a 7-digit CTR identifier string/number.",
      "evidence": [
        "backend/main.mo"
      ]
    },
    {
      "id": "REQ-4",
      "requirement": "Wire existing React Query hooks so CTR connect UI can actually connect and app detects connected state after refresh/reload.",
      "reason": "Although hooks now call actor.registerCTR and query actor.isCTRRegistered, the connect mutation does not actually register the user-entered CTR value: it constructs an anonymous principal and ignores the provided ctrId. This prevents correct per-CTR enforcement and means the UI is not truly connecting the entered CTR.",
      "evidence": [
        "frontend/src/hooks/useQueries.ts (truncated)",
        "frontend/src/components/scan-earn/CtrConnect.tsx (truncated)"
      ]
    }
  ],
  "hallucinated_features": [
    {
      "description": "Backend CTR registration implemented as mapping principal->Principal (CTR canister principal) and reverse mapping, rather than a 7-digit CTR value.",
      "reason": "BuildRequest describes enforcing “Only per CTR Registered user” with a CTR value in the frontend that is exactly 7 digits. The diff implements a different model (CTR as Principal) and the frontend mutation registers a placeholder Principal unrelated to the entered 7-digit CTR.",
      "evidence": [
        "backend/main.mo",
        "frontend/src/hooks/useQueries.ts (truncated)"
      ]
    }
  ],
  "confidence": 0.74,
  "changed_files": [
    "backend/main.mo",
    "frontend-file-summaries.txt",
    "frontend/src/App.tsx",
    "frontend/src/components/scan-earn/CtrConnect.tsx",
    "frontend/src/components/scan-earn/ScanRewards.tsx",
    "frontend/src/hooks/useQueries.ts",
    "frontend/src/lib/format.ts",
    "frontend/src/utils/whatsapp.ts",
    "project_state.json"
  ]
}